espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/inc/em_lcd.h
#if defined(_SILICON_LABS_32B_SERIES_1) || defined(_SILICON_LABS_32B_SERIES_2)
/** Mode of operation. */
typedef enum {
#if defined(_SILICON_LABS_32B_SERIES_1)
  lcdModeNoExtCap = LCD_DISPCTRL_MODE_NOEXTCAP, /**< No external capacitor. */
  lcdModeStepDown = LCD_DISPCTRL_MODE_STEPDOWN, /**< External cap with resistor string. */
  lcdModeCpIntOsc = LCD_DISPCTRL_MODE_CPINTOSC, /**< External cap and internal oscillator. */
#elif defined(_SILICON_LABS_32B_SERIES_2)
  lcdModeStepDown   = LCD_BIASCTRL_MODE_STEPDOWN,   /**< External cap with resistor string. */
  lcdModeChargePump = LCD_BIASCTRL_MODE_CHARGEPUMP, /**< External cap and internal oscillator. */
#endif
} LCD_Mode_Typedef;
#endif

/** Frame Counter Clock Prescaler, FC-CLK = FrameRate (Hz) / this factor. */
typedef enum {
#if defined(_SILICON_LABS_32B_SERIES_2)
  /** Prescale Div 1. */
  lcdFCPrescDiv1 = LCD_BACFG_FCPRESC_DIV1,
  /** Prescale Div 2. */
  lcdFCPrescDiv2 = LCD_BACFG_FCPRESC_DIV2,
  /** Prescale Div 4. */
  lcdFCPrescDiv4 = LCD_BACFG_FCPRESC_DIV4,
  /** Prescale Div 8. */
  lcdFCPrescDiv8 = LCD_BACFG_FCPRESC_DIV8
#else
  /** Prescale Div 1. */
  lcdFCPrescDiv1 = LCD_BACTRL_FCPRESC_DIV1,
  /** Prescale Div 2. */
  lcdFCPrescDiv2 = LCD_BACTRL_FCPRESC_DIV2,
  /** Prescale Div 4. */
  lcdFCPrescDiv4 = LCD_BACTRL_FCPRESC_DIV4,
  /** Prescale Div 8. */
  lcdFCPrescDiv8 = LCD_BACTRL_FCPRESC_DIV8
#endif
} LCD_FCPreScale_TypeDef;

#if defined(_SILICON_LABS_32B_SERIES_0)
/** Segment selection. */
typedef enum {
  /** Select segment lines 0 to 3. */
  lcdSegment0_3   = (1 << 0),
  /** Select segment lines 4 to 7. */
  lcdSegment4_7   = (1 << 1),
  /** Select segment lines 8 to 11. */
  lcdSegment8_11  = (1 << 2),
  /** Select segment lines 12 to 15. */
  lcdSegment12_15 = (1 << 3),
  /** Select segment lines 16 to 19. */
  lcdSegment16_19 = (1 << 4),
  /** Select segment lines 20 to 23. */
  lcdSegment20_23 = (1 << 5),
#if defined(_LCD_SEGD0L_MASK) && (_LCD_SEGD0L_MASK == 0x00FFFFFFUL)
  /** Select all segment lines. */
  lcdSegmentAll   = (0x003f)
#elif defined(_LCD_SEGD0H_MASK) && (_LCD_SEGD0H_MASK == 0x000000FFUL)
  /** Select segment lines 24 to 27. */
  lcdSegment24_27 = (1 << 6),
  /** Select segment lines 28 to 31. */
  lcdSegment28_31 = (1 << 7),
  /** Select segment lines 32 to 35. */
  lcdSegment32_35 = (1 << 8),
  /** Select segment lines 36 to 39. */
  lcdSegment36_39 = (1 << 9),
  /** Select all segment lines. */
  lcdSegmentAll   = (0x03ff)
#endif
} LCD_SegmentRange_TypeDef;
#endif

/** Update Data Control. */
typedef enum {
  /** Regular update, data transfer done immediately. */
  lcdUpdateCtrlRegular      = LCD_CTRL_UDCTRL_REGULAR,
  /** Data transfer done at Frame Counter event. */
  lcdUpdateCtrlFCEvent      = LCD_CTRL_UDCTRL_FCEVENT,
  /** Data transfer done at Frame Start.  */
  lcdUpdateCtrlFrameStart   = LCD_CTRL_UDCTRL_FRAMESTART,
#if defined(_SILICON_LABS_32B_SERIES_2)
  /** Data transfer done at Display Counter event.  */
  lcdUpdateCtrlDisplayEvent = LCD_CTRL_UDCTRL_DISPLAYEVENT
#endif
} LCD_UpdateCtrl_TypeDef;

#if defined(_SILICON_LABS_32B_SERIES_2)
/** Auto Load address which will start the synchronization from CLK_BUS to CLK_PER. */
typedef enum {
  /** Starts synchronizing registers after a write to BACTRL. */
  lcdLoadAddrNone   = 0,
  /** Starts synchronizing registers after a write to BACTRL. */
  lcdLoadAddrBactrl = LCD_UPDATECTRL_LOADADDR_BACTRLWR,
  /** Starts synchronizing registers after a write to AREGA. */
  lcdLoadAddrAregA  = LCD_UPDATECTRL_LOADADDR_AREGAWR,
  /** Starts synchronizing registers after a write to AREGB. */
  lcdLoadAddrAregB  = LCD_UPDATECTRL_LOADADDR_AREGBWR,
  /** Starts synchronizing registers after a write to SEGD0. */
  lcdLoadAddrSegd0  = LCD_UPDATECTRL_LOADADDR_SEGD0WR,
  /** Starts synchronizing registers after a write to SEGD1. */
  lcdLoadAddrSegd1  = LCD_UPDATECTRL_LOADADDR_SEGD1WR,
  /** Starts synchronizing registers after a write to SEGD2. */
  lcdLoadAddrSegd2  = LCD_UPDATECTRL_LOADADDR_SEGD2WR,
  /** Starts synchronizing registers after a write to SEGD3. */
  lcdLoadAddrSegd3  = LCD_UPDATECTRL_LOADADDR_SEGD3WR
} LCD_LoadAddr_TypeDef;
#endif

/** Animation Shift operation; none, left or right. */
typedef enum {
  /** No shift. */
  lcdAnimShiftNone  = _LCD_BACTRL_AREGASC_NOSHIFT,
  /** Shift segment bits left. */
  lcdAnimShiftLeft  = _LCD_BACTRL_AREGASC_SHIFTLEFT,
  /** Shift segment bits right. */
  lcdAnimShiftRight = _LCD_BACTRL_AREGASC_SHIFTRIGHT
} LCD_AnimShift_TypeDef;

/** Animation Logic Control, how AReg and BReg should be combined. */
typedef enum {
  /** Use bitwise logic AND to mix animation register A (AREGA) and B (AREGB). */
  lcdAnimLogicAnd = LCD_BACTRL_ALOGSEL_AND,
  /** Use bitwise logic OR to mix animation register A (AREGA) and B (AREGB).  */
  lcdAnimLogicOr  = LCD_BACTRL_ALOGSEL_OR
} LCD_AnimLogic_TypeDef;

#if defined(_LCD_BACTRL_ALOC_MASK)
/** Animation Location, set the LCD segments which animation applies to. */
typedef enum {
  /** Animation appears on segments 0 to 7. */
  lcdAnimLocSeg0To7  = LCD_BACTRL_ALOC_SEG0TO7,
  /** Animation appears on segments 8 to 15.  */
  lcdAnimLocSeg8To15 = LCD_BACTRL_ALOC_SEG8TO15
} LCD_AnimLoc_TypeDef;
#endif

#if defined(_LCD_DISPCTRL_CHGRDST_MASK)
/** Charge redistribution control. */
typedef enum {
  /** Disable charge redistribution. */
  lcdChargeRedistributionDisable    = LCD_DISPCTRL_CHGRDST_DISABLE,
  /** Use 1 prescaled low frequency clock cycle for charge redistribution. */
  lcdChargeRedistributionEnable     = LCD_DISPCTRL_CHGRDST_ONE,
  /** Use 2 prescaled low frequency clock cycle for charge redistribution. */
  lcdChargeRedistributionTwoCycle   = LCD_DISPCTRL_CHGRDST_TWO,
  /** Use 3 prescaled low frequency clock cycle for charge redistribution. */
  lcdChargeRedistributionThreeCycle = LCD_DISPCTRL_CHGRDST_THREE,
  /** Use 4 prescaled low frequency clock cycle for charge redistribution. */
  lcdChargeRedistributionFourCycle  = LCD_DISPCTRL_CHGRDST_FOUR
} LCD_ChargeRedistribution_TypeDef;
#endif

