espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/inc/em_lcd.h
#if defined(_SILICON_LABS_32B_SERIES_2)
/** DMA mode of operation. */
typedef enum {
  lcdDmaModeDisable      = LCD_BIASCTRL_DMAMODE_DMADISABLE,   /**< No DMA requests are generated. */
  lcdDmaModeFrameCounterEvent   = LCD_BIASCTRL_DMAMODE_DMAFC, /**< DMA request on frame counter event. */
  lcdDmaModeDisplayEvent = LCD_BIASCTRL_DMAMODE_DMADISPLAY    /**< DMA request on display counter event. */
} LCD_DmaMode_Typedef;
#endif

/*******************************************************************************
 *******************************   STRUCTS   ***********************************
 ******************************************************************************/

/** LCD Animation Configuration. */
typedef struct {
  /** Enable Animation at end of initialization. */
  bool                  enable;
  /** Initial Animation Register A Value. */
  uint32_t              AReg;
  /** Shift operation of Animation Register A. */
  LCD_AnimShift_TypeDef AShift;
  /** Initial Animation Register B Value. */
  uint32_t              BReg;
  /** Shift operation of Animation Register B. */
  LCD_AnimShift_TypeDef BShift;
  /** A and B Logical Operation to use for mixing and outputting resulting segments. */
  LCD_AnimLogic_TypeDef animLogic;
#if defined(_LCD_BACTRL_ALOC_MASK)
  /** Number of first segment to animate. */
  LCD_AnimLoc_TypeDef   startSeg;
#endif
} LCD_AnimInit_TypeDef;

/** LCD Frame Control Initialization. */
typedef struct {
  /** Enable at end. */
  bool                   enable;
  /** Frame Counter top value. */
  uint32_t               top;
  /** Frame Counter clock prescaler. */
  LCD_FCPreScale_TypeDef prescale;
} LCD_FrameCountInit_TypeDef;

/** LCD Controller Initialization structure. */
typedef struct {
  /** Enable controller at end of initialization. */
  bool                enable;
  /** Mux configuration. */
  LCD_Mux_TypeDef     mux;
  /** Bias configuration. */
  LCD_Bias_TypeDef    bias;
  /** Wave configuration. */
  LCD_Wave_TypeDef    wave;
#if defined(_SILICON_LABS_32B_SERIES_0)
  /** VLCD Select. */
  LCD_VLCDSel_TypeDef vlcd;
  /** Contrast Configuration. */
  LCD_ConConf_TypeDef contrast;
#endif
#if defined(_SILICON_LABS_32B_SERIES_1) || defined(_SILICON_LABS_32B_SERIES_2)
  /** Mode of operation. */
  LCD_Mode_Typedef                      mode;
  /** Charge redistribution cycles. */
  LCD_ChargeRedistribution_TypeDef      chargeRedistribution;
  /** Frame rate divider. */
  uint8_t                               frameRateDivider;
  /** Contrast level. */
  int                                   contrastLevel;
#if defined(_SILICON_LABS_32B_SERIES_2)
  /** Clock Prescaler. */
  uint32_t                              clockPrescaler;
#endif
#endif
} LCD_Init_TypeDef;

/** Default configuration for LCD initialization structure, enables 160 segments.  */
#if defined(_SILICON_LABS_32B_SERIES_0)
#define LCD_INIT_DEFAULT \
  {                      \
    true,                \
    lcdMuxQuadruplex,    \
    lcdBiasOneThird,     \
    lcdWaveLowPower,     \
    lcdVLCDSelVDD,       \
    lcdConConfVLCD,      \
  }
#endif

#if defined(_SILICON_LABS_32B_SERIES_1)
#define LCD_INIT_DEFAULT           \
  {                                \
    true,                          \
    lcdMuxOctaplex,                \
    lcdBiasOneFourth,              \
    lcdWaveLowPower,               \
    lcdModeNoExtCap,               \
    lcdChargeRedistributionEnable, \
    LCD_DEFAULT_FRAME_RATE_DIV,    \
    LCD_DEFAULT_CONTRAST           \
  }
#endif

#if defined(_SILICON_LABS_32B_SERIES_2)
#define LCD_INIT_DEFAULT           \
  {                                \
    true,                          \
    lcdMuxQuadruplex,              \
    lcdBiasOneFourth,              \
    lcdWaveLowPower,               \
    lcdModeStepDown,               \
    lcdChargeRedistributionEnable, \
    LCD_DEFAULT_FRAME_RATE_DIV,    \
    LCD_DEFAULT_CONTRAST,          \
    LCD_DEFAULT_CLOCK_PRESCALER    \
  }
#endif

/*******************************************************************************
 *****************************   PROTOTYPES   **********************************
 ******************************************************************************/

void LCD_Init(const LCD_Init_TypeDef *lcdInit);
#if defined(_SILICON_LABS_32B_SERIES_0)
void LCD_VLCDSelect(LCD_VLCDSel_TypeDef vlcd);
#endif
void LCD_UpdateCtrl(LCD_UpdateCtrl_TypeDef ud);
void LCD_FrameCountInit(const LCD_FrameCountInit_TypeDef *fcInit);
void LCD_AnimInit(const LCD_AnimInit_TypeDef *animInit);

#if defined(_SILICON_LABS_32B_SERIES_0)
void LCD_SegmentRangeEnable(LCD_SegmentRange_TypeDef segment, bool enable);
#endif
#if defined(_SILICON_LABS_32B_SERIES_2)
void LCD_SegmentEnable(uint32_t seg_nbr, bool enable);
void LCD_ComEnable(uint8_t com, bool enable);
void LCD_DmaModeSet(LCD_DmaMode_Typedef mode);
#endif
void LCD_SegmentSet(int com, int bit, bool enable);
void LCD_SegmentSetLow(int com, uint32_t mask, uint32_t bits);
#if defined(_LCD_SEGD0H_MASK)
void LCD_SegmentSetHigh(int com, uint32_t mask, uint32_t bits);
#endif
void LCD_ContrastSet(int level);
void LCD_BiasSet(LCD_Bias_TypeDef bias);
#if defined(_SILICON_LABS_32B_SERIES_0)
void LCD_VBoostSet(LCD_VBoostLevel_TypeDef vboost);
#endif
#if defined(LCD_CTRL_DSC)
void LCD_BiasSegmentSet(int segment, int biasLevel);
void LCD_BiasComSet(int com, int biasLevel);
#endif
#if defined(_SILICON_LABS_32B_SERIES_1) || defined(_SILICON_LABS_32B_SERIES_2)
void LCD_ModeSet(LCD_Mode_Typedef mode);
void LCD_ChargeRedistributionCyclesSet(uint8_t cycles);
#endif

#if defined(_SILICON_LABS_32B_SERIES_2)
/***************************************************************************//**
 * @brief
 *    Wait for load synchronization completion.
 *
 * @note
 *    Doing any writes to HV registers will not go through and will cause a
 *    bus fault.
 ******************************************************************************/
__STATIC_INLINE void LCD_LoadBusyWait(void)
{
  while (LCD->STATUS & _LCD_STATUS_LOADBUSY_MASK) ;
}
#endif

