espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/inc/em_lcd.h
#if defined(_SILICON_LABS_32B_SERIES_2)
/***************************************************************************//**
 * @brief
 *    Wait for the LCD to complete resetting or disabling procedure.
 ******************************************************************************/
__STATIC_INLINE void LCD_ReadyWait(void)
{
  while ((LCD->SWRST & _LCD_SWRST_RESETTING_MASK)
         || (LCD->EN & _LCD_EN_DISABLING_MASK)
         || (LCD->STATUS & _LCD_STATUS_LOADBUSY_MASK)) {
    // Wait for all synchronizations to finish
  }
}
#endif

/***************************************************************************//**
 * @brief
 *   Enable or disable LCD controller.
 *
 * @param[in] enable
 *   If true, enables LCD controller with current configuration. If false,
 *   disables LCD controller. Enable CMU clock for LCD for correct
 *   operation.
 ******************************************************************************/
__STATIC_INLINE void LCD_Enable(bool enable)
{
#if defined(_SILICON_LABS_32B_SERIES_2)
  if (enable) {
    LCD->EN_SET = LCD_EN_EN;
  } else {
    /* Wait for internal synchronization completion. */
    LCD_LoadBusyWait();

    LCD->EN_CLR = LCD_EN_EN;
    while (LCD->EN & _LCD_EN_DISABLING_MASK) {
    }
  }
#else

#if defined(LCD_HAS_SET_CLEAR)
  if (enable) {
    LCD->CTRL_SET = LCD_CTRL_EN;
  } else {
    LCD->CTRL_CLR = LCD_CTRL_EN;
  }
#else
  if (enable) {
    LCD->CTRL |= LCD_CTRL_EN;
  } else {
    LCD->CTRL &= ~LCD_CTRL_EN;
  }
#endif // LCD_HAS_SET_CLEAR

#endif // _SILICON_LABS_32B_SERIES_2
}

#if defined(_SILICON_LABS_32B_SERIES_2)
/***************************************************************************//**
 * @brief
 *   Reset the LCD.
 ******************************************************************************/
__STATIC_INLINE void LCD_Reset(void)
{
  LCD->SWRST_SET = LCD_SWRST_SWRST;

  /* Wait for reset to complete. */
  while ((LCD->SWRST & _LCD_SWRST_RESETTING_MASK)) {
  }
}
#endif

/***************************************************************************//**
 * @brief
 *   Enable or disable LCD Animation feature.
 *
 * @param[in] enable
 *   Boolean true enables animation, false disables animation.
 ******************************************************************************/
__STATIC_INLINE void LCD_AnimEnable(bool enable)
{
#if defined(LCD_HAS_SET_CLEAR)
  if (enable) {
    LCD->BACTRL_SET = LCD_BACTRL_AEN;
  } else {
    LCD->BACTRL_CLR = LCD_BACTRL_AEN;
  }
#else
  if (enable) {
    LCD->BACTRL |= LCD_BACTRL_AEN;
  } else {
    LCD->BACTRL &= ~LCD_BACTRL_AEN;
  }
#endif
}

/***************************************************************************//**
 * @brief
 *   Enable or disable the LCD blink.
 *
 * @param[in] enable
 *   Boolean true enables blink, false disables blink.
 ******************************************************************************/
__STATIC_INLINE void LCD_BlinkEnable(bool enable)
{
#if defined(LCD_HAS_SET_CLEAR)
  if (enable) {
    LCD->BACTRL_SET = LCD_BACTRL_BLINKEN;
  } else {
    LCD->BACTRL_CLR = LCD_BACTRL_BLINKEN;
  }
#else
  if (enable) {
    LCD->BACTRL |= LCD_BACTRL_BLINKEN;
  } else {
    LCD->BACTRL &= ~LCD_BACTRL_BLINKEN;
  }
#endif
}

/***************************************************************************//**
 * @brief
 *   Disable all segments while keeping segment state.
 *
 * @param[in] enable
 *   Boolean true clears all segments, boolean false restores all segment lines.
 ******************************************************************************/
__STATIC_INLINE void LCD_BlankEnable(bool enable)
{
#if defined(LCD_HAS_SET_CLEAR)
  if (enable) {
    LCD->BACTRL_SET = LCD_BACTRL_BLANK;
  } else {
    LCD->BACTRL_CLR = LCD_BACTRL_BLANK;
  }
#else
  if (enable) {
    LCD->BACTRL |= LCD_BACTRL_BLANK;
  } else {
    LCD->BACTRL &= ~LCD_BACTRL_BLANK;
  }
#endif
}

/***************************************************************************//**
 * @brief
 *   Enable or disable LCD Frame counter.
 *
 * @param[in] enable
 *   Boolean true enables frame counter, false disables frame counter.
 ******************************************************************************/
__STATIC_INLINE void LCD_FrameCountEnable(bool enable)
{
#if defined(_SILICON_LABS_32B_SERIES_2)
  /* Ensure no internal sync is in progress. */
  LCD_LoadBusyWait();
#endif

#if defined(LCD_HAS_SET_CLEAR)
  if (enable) {
    LCD->BACTRL_SET = LCD_BACTRL_FCEN;
  } else {
    LCD->BACTRL_CLR = LCD_BACTRL_FCEN;
  }
#else
  if (enable) {
    LCD->BACTRL |= LCD_BACTRL_FCEN;
  } else {
    LCD->BACTRL &= ~LCD_BACTRL_FCEN;
  }
#endif
}

#if defined(_SILICON_LABS_32B_SERIES_2)
/***************************************************************************//**
 * @brief
 *   Enable or disable the LCD Display counter.
 *
 * @param[in] enable
 *   Boolean true enables display counter, false disables display counter.
 ******************************************************************************/
__STATIC_INLINE void LCD_DisplayCountEnable(bool enable)
{
  /* Ensure no internal sync is in progress. */
  LCD_LoadBusyWait();

  if (enable) {
    LCD->BACTRL_SET = LCD_BACTRL_DISPLAYCNTEN;
  } else {
    LCD->BACTRL_CLR = LCD_BACTRL_DISPLAYCNTEN;
  }
}
#endif

/***************************************************************************//**
 * @brief
 *   Return the current animation state.
 *
 * @return
 *   Animation state, in range 0-15.
 ******************************************************************************/
__STATIC_INLINE int LCD_AnimState(void)
{
  return (int)(LCD->STATUS & _LCD_STATUS_ASTATE_MASK) >> _LCD_STATUS_ASTATE_SHIFT;
}

/***************************************************************************//**
 * @brief
 *   Return the current blink state.
 *
 * @return
 *   Return value is 1 if segments are enabled, 0 if disabled.
 ******************************************************************************/
__STATIC_INLINE int LCD_BlinkState(void)
{
  return (int)(LCD->STATUS & _LCD_STATUS_BLINK_MASK) >> _LCD_STATUS_BLINK_SHIFT;
}

#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
/***************************************************************************//**
 * @brief
 *   When set, LCD registers will not be updated until cleared.
 *
 * @param[in] enable
 *   When enable is true, update is stopped; when false, all registers are
 *   updated.
 ******************************************************************************/
__STATIC_INLINE void LCD_FreezeEnable(bool enable)
{
  if (enable) {
    LCD->FREEZE = LCD_FREEZE_REGFREEZE_FREEZE;
  } else {
    LCD->FREEZE = LCD_FREEZE_REGFREEZE_UPDATE;
  }
}
#endif

#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
/***************************************************************************//**
 * @brief
 *   Return SYNCBUSY bits, indicating which registers have pending updates.
 *
 * @return
 *   Bit fields for LCD registers that have pending updates.
 ******************************************************************************/
__STATIC_INLINE uint32_t LCD_SyncBusyGet(void)
{
  return LCD->SYNCBUSY;
}
#endif

#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
/***************************************************************************//**
 * @brief
 *   Poll LCD SYNCBUSY flags until the flag has been cleared.
 *
 * @param[in] flags
 *   Bit fields for LCD registers that will be updated before we continue.
 ******************************************************************************/
__STATIC_INLINE void LCD_SyncBusyDelay(uint32_t flags)
{
  while (LCD->SYNCBUSY & flags) ;
}
#endif

