espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/inc/em_lcd.h
#if defined(_SILICON_LABS_32B_SERIES_2)
/***************************************************************************//**
 * @brief
 *   Start the synchronization process.
 *
 * @param[in] autoload
 *   Flag indicating if the synchronization is started manually with CMD.LOAD
 *   (false) or if the synchronization is managed automatically by Auto Load
 *   (true).
 *
 * @param[in] load_addr
 *   Address which will start the synchronization from CLK_BUS to CLK_PER
 *   when Auto Load is selected. This argument has no effect if 'autoload' is
 *   false.
 ******************************************************************************/
__STATIC_INLINE void LCD_SyncStart(bool autoload, LCD_LoadAddr_TypeDef load_addr)
{
  /* Ensure no synchronization in progress. */
  LCD_LoadBusyWait();

  if (autoload) {
    LCD_Enable(false); /* Ensure LCD disabled before writing WSTATIC fields. */
    LCD_ReadyWait();
    LCD->UPDATECTRL_CLR = _LCD_UPDATECTRL_LOADADDR_MASK;
    LCD->UPDATECTRL |= load_addr;
    LCD->UPDATECTRL_SET = LCD_UPDATECTRL_AUTOLOAD;
    LCD_Enable(true);
  } else {
    /* Start synchronization from HV registers to CLK_PER domain. */
    LCD->CMD = LCD_CMD_LOAD;
  }
}
#endif

#if defined(_SILICON_LABS_32B_SERIES_2)
/***************************************************************************//**
 * @brief
 *   Stop the synchronization process.
 *
 * @param[in] autoload
 *   Flag indicating if the synchronization is stopped manually with CMD.CLEAR
 *   (false) or if the synchronization managed by Auto Load is disabled (true).
 ******************************************************************************/
__STATIC_INLINE void LCD_SyncStop(bool autoload)
{
  if (autoload) {
    /* Autoload cannot be disabled if synchronization in progress. */
    LCD_LoadBusyWait();

    LCD->UPDATECTRL_CLR = LCD_UPDATECTRL_AUTOLOAD;
    LCD->UPDATECTRL_CLR = _LCD_UPDATECTRL_LOADADDR_MASK;
  } else {
    LCD->CMD = LCD_CMD_CLEAR;
  }
}
#endif

/***************************************************************************//**
 * @brief
 *    Get pending LCD interrupt flags.
 *
 * @return
 *   Pending LCD interrupt sources. Returns a set of interrupt flags OR-ed
 *   together for multiple interrupt sources in the LCD module (LCD_IFS_nnn).
 ******************************************************************************/
__STATIC_INLINE uint32_t LCD_IntGet(void)
{
  return LCD->IF;
}

/***************************************************************************//**
 * @brief
 *   Get enabled and pending LCD interrupt flags.
 *
 * @details
 *   Useful for handling more interrupt sources in the same interrupt handler.
 *
 * @note
 *   Event bits are not cleared by the use of this function.
 *
 * @return
 *   Pending and enabled LCD interrupt sources.
 *   Return value is the bitwise AND combination of
 *   - the OR combination of enabled interrupt sources in LCD_IEN_nnn
 *   register (LCD_IEN_nnn) and
 *   - the bitwise OR combination of valid interrupt flags of LCD module
 *   (LCD_IF_nnn).
 ******************************************************************************/
__STATIC_INLINE uint32_t LCD_IntGetEnabled(void)
{
  uint32_t ien;

  /* Store the LCD->IEN in temporary variable to define the explicit order
   * of volatile accesses. */
  ien = LCD->IEN;

  /* Bitwise AND of pending and enabled interrupts */
  return LCD->IF & ien;
}

/***************************************************************************//**
 * @brief
 *    Set one or more pending LCD interrupts from SW.
 *
 * @param[in] flags
 *   LCD interrupt sources to set to pending. Use a set of interrupt flags
 *   OR-ed together to set multiple interrupt sources for the LCD module
 *   (LCD_IFS_nnn).
 ******************************************************************************/
__STATIC_INLINE void LCD_IntSet(uint32_t flags)
{
#if defined(_SILICON_LABS_32B_SERIES_2)
#if defined(LCD_HAS_SET_CLEAR)
  LCD->IF_SET = flags;
#else
  LCD->IF |= flags;
#endif // LCD_HAS_SET_CLEAR
#else
  LCD->IFS = flags;
#endif
}

/***************************************************************************//**
 * @brief
 *    Enable LCD interrupts.
 *
 * @param[in] flags
 *   LCD interrupt sources to enable. Use a set of interrupt flags OR-ed
 *   together to set multiple interrupt sources for LCD module
 *   (LCD_IFS_nnn).
 ******************************************************************************/
__STATIC_INLINE void LCD_IntEnable(uint32_t flags)
{
#if defined(LCD_HAS_SET_CLEAR)
  LCD->IEN_SET = flags;
#else
  LCD->IEN |= flags;
#endif
}

/***************************************************************************//**
 * @brief
 *    Disable LCD interrupts.
 *
 * @param[in] flags
 *   LCD interrupt sources to disable. Use a set of interrupt flags OR-ed
 *   together to disable multiple interrupt sources for LCD module
 *   (LCD_IFS_nnn).
 ******************************************************************************/
__STATIC_INLINE void LCD_IntDisable(uint32_t flags)
{
#if defined(LCD_HAS_SET_CLEAR)
  LCD->IEN_CLR = flags;
#else
  LCD->IEN &= ~flags;
#endif
}

/***************************************************************************//**
 * @brief
 *   Clear one or more interrupt flags.
 *
 * @param[in] flags
 *   LCD interrupt sources to clear. Use a set of interrupt flags OR-ed
 *   together to clear multiple interrupt sources for LCD module
 *   (LCD_IFS_nnn).
 ******************************************************************************/
__STATIC_INLINE void LCD_IntClear(uint32_t flags)
{
#if defined(_SILICON_LABS_32B_SERIES_2)
#if defined(LCD_HAS_SET_CLEAR)
  LCD->IF_CLR = flags;
#else
  LCD->IF &= ~flags;
#endif // LCD_HAS_SET_CLEAR
#else
  LCD->IFC = flags;
#endif
}

#if defined(LCD_CTRL_DSC)
/***************************************************************************//**
 * @brief
 *   Enable or disable LCD Direct Segment Control.
 *
 * @param[in] enable
 *   If true, enables LCD controller Direct Segment Control
 *   Segment and COM line bias levels need to be set explicitly with
 *   LCD_BiasSegmentSet() and LCD_BiasComSet() function calls respectively.
 ******************************************************************************/
__STATIC_INLINE void LCD_DSCEnable(bool enable)
{
#if defined(_SILICON_LABS_32B_SERIES_2)
  LCD_Enable(false); /* Ensure LCD disabled before writing WSTATIC fields. */
  LCD_ReadyWait();
#endif

#if defined(LCD_HAS_SET_CLEAR)
  if (enable) {
    LCD->CTRL_SET = LCD_CTRL_DSC;
  } else {
    LCD->CTRL_CLR = LCD_CTRL_DSC;
  }
#else
  if (enable) {
    LCD->CTRL |= LCD_CTRL_DSC;
  } else {
    LCD->CTRL &= ~LCD_CTRL_DSC;
  }
#endif

#if defined(_SILICON_LABS_32B_SERIES_2)
  LCD_Enable(true);
#endif
}

#endif

/** @} (end addtogroup lcd) */

#ifdef __cplusplus
}
#endif

#endif /* defined(LCD_COUNT) && (LCD_COUNT > 0) */

#endif /* EM_LCD_H */
